9ghtX/L6IR_pro/rfu_stm32/source/rfu_stm32L10x.c
  /* Get the User Option byte register */
  tmp1 = (FLASH->OBR & 0x000F0000) >> 16;

  /* Calculate the user option byte to write */
  tmp = (uint32_t)(((uint32_t)~((uint32_t)((uint32_t)(OB_IWDG) | (uint32_t)(OB_STOP) | (uint32_t)(OB_STDBY) | tmp1))) << ((uint32_t)0x10));
  tmp |= ((uint32_t)(OB_IWDG) | ((uint32_t)OB_STOP) | (uint32_t)(OB_STDBY) | tmp1);

  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(FLASH_ER_PRG_TIMEOUT);

  if(status == FLASH_COMPLETE)
  {
    /* Write the User Option Byte */
    OB->USER = tmp;
  }

  /* Wait for last operation to be completed */
    status = RFU_FLASH_WaitForLastOperation(FLASH_ER_PRG_TIMEOUT);

  /* Return the Option Byte program Status */
  return status;
}

/**
  * @brief  Programs the FLASH brownout reset threshold level Option Byte.
  * @param  OB_BOR: Selects the brownout reset threshold level.
  *   This parameter can be one of the following values:
  *     @arg OB_BOR_OFF: BOR is disabled at power down, the reset is asserted when the VDD
  *                      power supply reaches the PDR(Power Down Reset) threshold (1.5V)
  *     @arg OB_BOR_LEVEL1: BOR Reset threshold levels for 1.7V - 1.8V VDD power supply
  *     @arg OB_BOR_LEVEL2: BOR Reset threshold levels for 1.9V - 2.0V VDD power supply
  *     @arg OB_BOR_LEVEL3: BOR Reset threshold levels for 2.3V - 2.4V VDD power supply
  *     @arg OB_BOR_LEVEL4: BOR Reset threshold levels for 2.55V - 2.65V VDD power supply
  *     @arg OB_BOR_LEVEL5: BOR Reset threshold levels for 2.8V - 2.9V VDD power supply
  * @retval FLASH Status: The returned value can be:
  * FLASH_ERROR_PROGRAM, FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_OB_BORConfig(uint8_t OB_BOR)
{
  FLASH_Status status = FLASH_COMPLETE;
  uint32_t tmp = 0, tmp1 = 0;

  /* Check the parameters */
  assert_param(IS_OB_BOR_LEVEL(OB_BOR));

  /* Get the User Option byte register */
  tmp1 = (FLASH->OBR & 0x00F00000) >> 16;

  /* Calculate the option byte to write */
  tmp = (uint32_t)~(OB_BOR | tmp1)<<16;
  tmp |= (OB_BOR | tmp1);

  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(FLASH_ER_PRG_TIMEOUT);

  if(status == FLASH_COMPLETE)
  {
    /* Write the BOR Option Byte */
    OB->USER = tmp;
  }

  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(FLASH_ER_PRG_TIMEOUT);

  /* Return the Option Byte program Status */
  return status;
}

/**
  * @brief  Configures to boot from Bank1 or Bank2.
  * @note   This function can be used only for STM32L1XX_HD and STM32L1XX_XL devices.
  * @param  OB_BOOT: select the FLASH Bank to boot from.
  *   This parameter can be one of the following values:
  *     @arg OB_BOOT_BANK2: At startup, if boot pins are set in boot from user Flash
  *        position and this parameter is selected the device will boot from Bank2 or Bank1,
  *        depending on the activation of the bank. The active banks are checked in
  *        the following order: Bank2, followed by Bank1.
  *        The active bank is recognized by the value programmed at the base address
  *        of the respective bank (corresponding to the initial stack pointer value
  *        in the interrupt vector table).
  *     @arg OB_BOOT_BANK1: At startup, if boot pins are set in boot from user Flash
  *        position and this parameter is selected the device will boot from Bank1(Default).
  *        For more information, please refer to AN2606 from www.st.com.
  * @retval FLASH Status: The returned value can be:
  *         FLASH_ERROR_PROGRAM, FLASH_ERROR_WRP, FLASH_COMPLETE or FLASH_TIMEOUT.
  */
FLASH_Status RFU_FLASH_OB_BootConfig(uint8_t OB_BOOT)
{
  FLASH_Status status = FLASH_COMPLETE;
  uint32_t tmp = 0, tmp1 = 0;

  /* Check the parameters */
  assert_param(IS_OB_BOOT_BANK(OB_BOOT));

  /* Get the User Option byte register */
  tmp1 = (FLASH->OBR & 0x007F0000) >> 16;

  /* Calculate the option byte to write */
  tmp = (uint32_t)~(OB_BOOT | tmp1)<<16;
  tmp |= (OB_BOOT | tmp1);

  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(FLASH_ER_PRG_TIMEOUT);

  if(status == FLASH_COMPLETE)
  {
    /* Write the BOOT Option Byte */
    OB->USER = tmp;
  }

  /* Wait for last operation to be completed */
  status = RFU_FLASH_WaitForLastOperation(FLASH_ER_PRG_TIMEOUT);

  /* Return the Option Byte program Status */
  return status;
}

/**
  * @brief  Returns the FLASH User Option Bytes values.
  * @param  None
  * @retval The FLASH User Option Bytes.
  */
uint8_t RFU_FLASH_OB_GetUser(void)
{
  /* Return the User Option Byte */
  return (uint8_t)(FLASH->OBR >> 20);
}

/**
  * @brief  Returns the FLASH Write Protection Option Bytes value.
  * @param  None
  * @retval The FLASH Write Protection Option Bytes value.
  */
uint32_t RFU_FLASH_OB_GetWRP(void)
{
  /* Return the FLASH write protection Register value */
  return (uint32_t)(FLASH->WRPR);
}

/**
  * @brief  Returns the FLASH Write Protection Option Bytes value.
  * @note   This function can be used only for STM32L1XX_HD, STM32L1XX_MDP and
  *         STM32L1XX_XL devices.
  * @param  None
  * @retval The FLASH Write Protection Option Bytes value.
  */
uint32_t RFU_FLASH_OB_GetWRP1(void)
{
  /* Return the FLASH write protection Register value */
  return (uint32_t)(FLASH->WRPR1);
}

/**
  * @brief  Returns the FLASH Write Protection Option Bytes value.
  * @note   This function can be used only for STM32L1XX_HD and STM32L1XX_XL devices.
  * @param  None
  * @retval The FLASH Write Protection Option Bytes value.
  */
uint32_t RFU_FLASH_OB_GetWRP2(void)
{
  /* Return the FLASH write protection Register value */
  return (uint32_t)(FLASH->WRPR2);
}

/**
  * @brief  Checks whether the FLASH Read out Protection Status is set or not.
  * @param  None
  * @retval FLASH ReadOut Protection Status(SET or RESET).
  */
FlagStatus RFU_FLASH_OB_GetRDP(void)
{
  FlagStatus readstatus = RESET;

  if ((uint8_t)(FLASH->OBR) != (uint8_t)OB_RDP_Level_0)
  {
    readstatus = SET;
  }
  else
  {
    readstatus = RESET;
  }
  return readstatus;
}

/**
  * @brief  Returns the SPRMOD Status.
  * @note   This function can be used only for STM32L1XX_MDP devices
  * @param  None
  * @retval The SPRMOD Status.
  */
FlagStatus RFU_FLASH_OB_GetSPRMOD(void)
{
  FlagStatus readstatus = RESET;
  uint16_t tmp = 0;

  /* Return the SPRMOD value */
  tmp = (uint16_t)(FLASH->OBR & (uint16_t)(0x0100));

